W6/RoutesAgain/app/controllers/artwork_shares_controller.rb

  def create
    artwork_share = ArtworkShare.new(artwork_shares_params)
    # artwork_share = artwork_share.new(artworkname: params[:artworkname])
    if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 1]]