W6/RoutesAgain/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    if params[:user_id] #is not nil
      user = User.find(params[:user_id])