W6/RoutesAgain/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # render plain: "I'm in the index action!"
    users = User.all

INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "User1"]]
---
  def create
    user = User.new(user_params)
    # user = User.new(username: params[:username])
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "User6"], ["id", 9]]
---
  def update
    user = User.find(params[:id])
    if user.update(user_params)