W12/D2/BenchBnB/app/controllers/application_controller.rb

    def current_user
        return nil unless session[:session_token]
        @current_user ||= User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "_eOllZzzSgwBjMF1MwdgLQ"], ["LIMIT", 1]]