W12/D2/BenchBnB/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Y1ZK2XBvTVeW7g_lzWIRvQ"], ["updated_at", "2021-11-17 00:32:03.390617"], ["id", 1]]
---
    def reset_session_token!
        # When a user logs out, we want to scramble their session_token so that bad people cannot use the old one
        self.session_token = SecureRandom.urlsafe_base64
        self.save